# Маємо дані, які прийшли у вигляді тексту (наприклад, з консолі чи з веб-сторінки)
user_input = "25"
pi_string = "3.14"

# Перетворюємо текст на числа для математики
age = user_input.to_i
puts age + 5 # Тепер це безпечно: 30

exact_pi = pi_string.to_f
puts exact_pi * 2 # Робота з дробовим числом: 6.28

# Зворотне перетворення: число в рядок
number = 42
p number.to_s # Виведе "42" (метод `p` покаже лапки, підтверджуючи, що це тепер рядок)


# .to_i — Convert to Integer (в ціле число)

# .to_f — Convert to Float (в дробове число)

# .to_s — Convert to String (в рядок)