# 1. puts (put string) — виводить текст і автоматично переносить курсор на новий рядок.
puts "Перший рядок"
puts "Другий рядок"

# 2. print — виводить текст БЕЗ переносу на новий рядок (все зліпиться в один).
print "Привіт, "
print "світ!"
print "\n" # це ручний перенос рядка, щоб наступний код не зліпився

# 3. p — це метод для розробників (дебаг). Він показує об'єкт ТАК, ЯК ЙОГО БАЧИТЬ RUBY.
# Наприклад, він покаже лапки у рядка, щоб ти точно знав тип даних.
p "Привіт, світ!"
p 42
p [1, 2, 3] # виведе масив прямо з дужками